
[
  {"id":1,
  "subfield_name":"Algorithms And Complexity",
  "subfield_discipline":"All 5 disciplines",
  "subfield_description":"An algorithm is a procedure for solving a well defined computational problem. They are used in all aspects of computer science such as artificial intelligence, databases, graphics, networking, operating systems, security, etc.","date_of_birth":"1979-11-16T23:04:32Z","age":45,"country":"Argentina","phone":"6844103517"},
  {"id":2,
    "subfield_name":"Architecture And Organization",
    "subfield_discipline":"Computer Science, Computer Engineering",
    "subfield_description":"Computer architecture is a subfield carried out mostly by Computer engineers and computer scientists since they both focus on hardware design.","date_of_birth":"1997-08-06T21:07:34Z","age":30,"country":"Greece","phone":"8429683893"},
  {"id":3,
    "subfield_name":"Computational Science",
    "subfield_discipline":"Computer Science",
    "subfield_description":"Consists of advancing goals in some sciences through computing, which include sciences like biology, chemistry, forensics, sociology and many more. It can apply computer simulation, math modeling, scientific visualization, data structures and algorithms, symbolic computation, networking, database design and high performance computing. ","date_of_birth":"2016-04-28T16:59:19Z","age":48,"country":"Czech Republic","phone":"8672773997"},
  {"id":4,
  "subfield_name":"Database Development",
  "subfield_discipline":"Computer Science, Computer Engineering",
  "subfield_description":"Ensure that database management systems can handle massive quantities of data. Also called database programmers, developers usually work as part of a software development team.","date_of_birth":"1997-08-06T21:07:34Z","age":30,"country":"Greece","phone":"8429683893"},
  {"id":5,
    "subfield_name":"Graphics And Visual Computing",
    "subfield_discipline":"Computer Science, Computer Engineering, Software Engineering",
    "subfield_description":"Encompasses the efficient implementation of four interrelated computational tasks: rendering, modeling, animation, and visualization. Graphics techniques incorporate principles of linear algebra, numerical integration, computational geometry, special-purpose hardware, file formats, and graphical user interfaces (GUIs) to accomplish these complex tasks. ","date_of_birth":"2016-04-28T16:59:19Z","age":48,"country":"Czech Republic","phone":"8672773997"},
  {"id":6,
    "subfield_name":"Human-Computer Interaction",
    "subfield_discipline":"Computer Science, Computer Engineering, Software Engineering",
    "subfield_description":"Designing effective interaction between users and computers and the construction of interfaces that support this interaction. It emerges to model, develop, and measure the effectiveness of various types of interfaces between a computer application and the person accessing its services. ","date_of_birth":"2021-04-28T16:59:19Z","age":23,"country":"Puerto Rico","phone":"8672773997"},
  {"id":7,
    "subfield_name":"Information Management",
    "subfield_discipline":"Computer Science, Software Engineering",
    "subfield_description":"Consists of the capture, digitization, representation, organization, transformation, and presentation of information. Comprise databases and algorithms for the efficient storage, retrieval, updating, and deleting of specific items in the database. ","date_of_birth":"2016-04-28T16:59:19Z","age":48,"country":"Czech Republic","phone":"8672773997"},
  {"id":8,
    "subfield_name":"Intelligent Systems",
    "subfield_discipline":"Computer Engineering, Software Engineering",
    "subfield_description":"Consists of building a machine that can perform tasks perceived as requiring human intelligence. The tasks that have been studied from this point of view include game playing, language translation, natural language understanding, fault diagnosis, robotics, and supplying expert advice. ","date_of_birth":"2016-04-28T16:59:19Z","age":48,"country":"Czech Republic","phone":"8672773997"},
  {
  }]